app/views/concordance/view.html.erb

SELECT "lines".* FROM "lines" WHERE "lines"."id" = 3402 LIMIT 1
SELECT "pages".* FROM "pages" WHERE (digital_edition_id = 1) ORDER BY page_page ASC LIMIT 1
---
      <tr class="concordance_lines_row">
      <%= raw(make_concordance_line_row(get_expression_siglum(cl.line.expression_id), right_adjust_elem(Work.find_work_short_code(cl.line.id)), right_adjust_elem(Work.find_work_siglum(cl.line.id)), right_adjust_elem(cl.line.line_page_order), bold_item(cl.line.line_tei, @concordance_token), cl.line.page_id, @concordance_token)) %>