app/controllers/concordance_controller.rb

  def showedition

    @edition = params[:id]

    # @concordance_entries = ConcordanceEntry.where("digital_edition_id = ?", params[:id]).order("concordance_entry_token ASC").page( params[:page]).per(20)

    # @concordance_entries = DigitalEditionHasConcordanceEntryTotal.joins(ConcordanceEntry).where("digital_edition_id = ?", params[:id]).order("concordance_entry_token ASC").page( params[:page]).per(20)

    # @concordance_entries = DigitalEditionHasConcordanceEntryTotal.joins("JOIN concordance_entries ON concordance_entries.id = digital_edition_has_concordance_entry_totals.id").where("digital_edition_id = ?", params[:id]).order("concordance_entry_token").page( params[:page]).per(20)

    @concordance_entries = ConcordanceEntry.joins(:digital_edition_has_concordance_entry_totals).where("digital_edition_id = ?", params[:id]).order("concordance_entry_token").page( params[:page]).per(68)
---
SELECT "concordance_entries".* FROM "concordance_entries" INNER JOIN "digital_edition_has_concordance_entry_totals" ON "digital_edition_has_concordance_entry_totals"."concordance_entry_id" = "concordance_entries"."id" WHERE (digital_edition_id = '1') ORDER BY concordance_entry_token LIMIT 68 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "concordance_entries" INNER JOIN "digital_edition_has_concordance_entry_totals" ON "digital_edition_has_concordance_entry_totals"."concordance_entry_id" = "concordance_entries"."id" WHERE (digital_edition_id = '1') LIMIT 68 OFFSET 0) subquery_for_count

  def showeditem

    @edid =  params[:id]
    @concid =  params[:it]

    #setup title link
    @title_nav_links = makeTitleLink(@edid)

    rs_concordance_entry  = ConcordanceEntry.find(@concid)
    str_sql_safe_token = rs_concordance_entry.concordance_entry_token.gsub(/'/i, "'")
    @concordance_token = rs_concordance_entry.concordance_entry_token

    #str_lines_where = "line_tei LIKE '" + rs_concordance_entry.concordance_entry_token + " %' OR line_tei LIKE '% " + rs_concordance_entry.concordance_entry_token + " %' OR line_tei LIKE '% " + rs_concordance_entry.concordance_entry_token + "' AND digital_edition_id = " +  @edid
    #@rs_concordance_lines = Line.where(str_lines_where).order("line_expression_order ASC").page( params[:page]).per(20)

    # "JOIN lines ON lines.id = digital_edition_has_concordance_entries.line_id"
    str_entries_where = "digital_edition_has_concordance_entries.digital_edition_id = " + @edid + " AND digital_edition_has_concordance_entries.concordance_entry_id = " + @concid
    @rs_concordance_lines = DigitalEditionHasConcordanceEntry.joins(:line).where(str_entries_where).order("lines.line_digital_edition_order ASC").page( params[:page]).per(20)


    rs_edition = DigitalEdition.find(@edid)
    rs_manifestation = Manifestation.find(rs_edition.manifestation_id)
    rs_expression_manifestation = ExpressionsHasManifestations.where("manifestation_id = ?", rs_manifestation.id).first
    rs_expression = Expression.find(rs_expression_manifestation.expression_id)
    @rs_work = Work.find(rs_expression.work_id)
---
SELECT "concordance_entries".* FROM "concordance_entries" WHERE "concordance_entries"."id" = ? LIMIT 1  [["id", "1139"]]
SELECT "digital_edition_has_concordance_entries".* FROM "digital_edition_has_concordance_entries" INNER JOIN "lines" ON "lines"."id" = "digital_edition_has_concordance_entries"."line_id" WHERE (digital_edition_has_concordance_entries.digital_edition_id = 1 AND digital_edition_has_concordance_entries.concordance_entry_id = 1139) ORDER BY lines.line_digital_edition_order ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "digital_edition_has_concordance_entries" INNER JOIN "lines" ON "lines"."id" = "digital_edition_has_concordance_entries"."line_id" WHERE (digital_edition_has_concordance_entries.digital_edition_id = 1 AND digital_edition_has_concordance_entries.concordance_entry_id = 1139)
SELECT "digital_editions".* FROM "digital_editions" WHERE "digital_editions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "manifestations".* FROM "manifestations" WHERE "manifestations"."id" = ? LIMIT 1  [["id", 1]]
SELECT "expressions_has_manifestations".* FROM "expressions_has_manifestations" WHERE (manifestation_id = 1) LIMIT 1
SELECT "expressions".* FROM "expressions" WHERE "expressions"."id" = ? LIMIT 1  [["id", 1]]
SELECT "works".* FROM "works" WHERE "works"."id" = ? LIMIT 1  [["id", 1]]