app/controllers/editions_controller.rb

  def show
    @digital_edition = DigitalEdition.find(params[:id])
---
SELECT "digital_editions".* FROM "digital_editions" WHERE (nav_category_id IN ( 1, 2) AND digital_edition_active LIKE 't') ORDER BY nav_category_id ASC, digital_edition_order ASC