app/controllers/splash_controller.rb

  def index

    @sidebar = makeBar()

    @confs = Conf.find(1)
---
SELECT "confs".* FROM "confs" WHERE "confs"."id" = ? LIMIT 1  [["id", 1]]